//Найдите гипотенузу k по теореме Пифагора
let n = 4;
let m = 3;
let k = Math.pow(n, m);

console.log(k);

//Напишите скрипт, который используя оператор while выведет все числа от 45 до 67.

// let m = 51;
// let n;

// if (m > 50) {
//   n = "большое";
//   console.log(n);
// } else {
//   console.log("smal");
// }

// Напишите скрипт, который используя оператор while выведет все числа от 45 до 67.

// let i = 45; //если переменную обозначать const то выдаёт ошибку
// while (i < 68) {
//   console.log(i++);
// }
